// pages/recoverable-garbage/recoverable-garbage.js
Page({

  /**
   * 页面的初始数据
   */
  data: {

  },






  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {
    var garbageKind =[
      {
        kind:"废纸类：",
        data:"报纸、杂志、图书、各种包装纸、办公用纸、纸盒等，但是纸巾和卫生用纸由于水溶性太强不可回收。"
      },
      {
        kind: "塑料类：",
        data: "各种塑料袋、塑料包装物和餐具、牙刷、杯子、矿泉水瓶、塑料玩具、塑料文具、塑料生活用品、洗发液瓶、洗手液瓶、洗衣液瓶、洗洁精瓶。"
      },
      {
        kind: "玻璃类：",
        data: "玻璃饮料瓶、玻璃酒瓶、坏玻璃杯、碎玻璃窗、废玻璃板、镜片、镜子等，根据回收工艺，玻璃分为无色玻璃，绿色玻璃，棕色玻璃。"
      },
      {
        kind: "金属类:",
        data: "易拉罐、金属罐头盒、装饰物、铝箔、铁片、铁钉、铁管、废铁丝、旧钢丝球、铜导线等，按照回收材料分类：铁类，非铁类(一般指有色金属)。"
      },
      {
        kind: "纺织物类：",
        data: "废弃衣服、裤子、袜子、毛巾、书包、布鞋、床单、被褥、毛绒玩具等。"
      },
      {
        kind: "危害垃圾类:",
        data: "油漆、颜料、各类清洗液等化学品，部分地区将电池和电子/电器垃圾也归于此类。"
      },
    ]
    var garbageData = [{
        data: "1、纸类应尽量叠放整齐，避免揉团，纸板也应拆开叠放。"
      },
      {
        data: "2、投放的牛奶利乐包等食品包装盒应折叠压扁。"
      },
      {
        data: "3、投放瓶罐类物品应尽可能将容器内产品用尽或倒尽，并清理干净后投放。"
      },
      {
        data: "4、玻璃类物品应小心轻放，以免割伤破损，最好是袋装或者用容器装好后投放。"
      },
      {
        data: "5、织物类应打包整齐后，定期投放到指定收集点。"
      },
    ]
    this.setData({
      textData:garbageData,
      kindData:garbageKind
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})