// pages/kitchen-waste/kitchen-waste.js
Page({

  /**
   * 页面的初始数据
   */
  data: {

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    var garbageKind = [
      {
        kind: "食材废料类：",
        data: "谷物及其加工食品（米、米饭、面、面包、豆类）、肉蛋及其加工食品（鸡、鸭、猪、牛、羊肉、蛋、动物内脏、腊肉、午餐肉、蛋壳）、水产及其加工食品（鱼、鱼鳞、虾、虾壳、鱿鱼）、蔬菜（绿叶菜、根茎蔬菜、菌菇）、调料、酱料等。"
      },
      {
        kind: "剩菜剩饭类：",
        data: "锅汤底（沥干后的固体废弃物）、鱼骨、碎骨、茶叶渣、咖啡渣等。"
      },
      {
        kind: "过期食品类：",
        data: "糕饼、糖果、风干食品（肉干、红枣、中药材）、粉末类食品（冲泡饮料、面粉）、宠物饲料等。"
      },
      {
        kind: "瓜皮果核类:",
        data: "水果果肉（椰子肉）、水果果皮（西瓜皮、桔子皮、苹果皮）、水果茎枝（葡萄枝）、果实（西瓜籽）等。"
      },
      {
        kind: "花卉植物类：",
        data: "家养绿植、花卉、花瓣、枝叶等。"
      },
      {
        kind: "其他:",
        data: "中药药渣等。"
      },
    ]
    var garbageData = [{
      data: "1、厨余垃圾应从产生时就与其他类别垃圾分开归类，去除食材食品的包装物，不得混入纸巾餐具、厨房用具等。"
    },
    {
      data: "2、餐厨垃圾中的废弃食用油脂，应单独存放、交付餐厨垃圾收集运输单位。"
    },
    {
      data: "3、难以生物降解的贝壳、大骨头、毛发等，宜作为其他垃圾投放。"
    },
    {
      data: "4、厨余垃圾（餐厨垃圾）滤去水分后再投放。"
    },
    {
      data: "5、包装物请投放到对应的干垃圾或其他容器中。"
    },
    ]
    this.setData({
      textData: garbageData,
      kindData: garbageKind
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})